"""
File: constants.py
Description: 定数を定義
Author: Kenta Matsumura
Created: 2024-03-13
Last Modified: 2024-03-17
"""

#########################
# ライブラリのインポート
#########################
import numpy as np


#########################
# 定数
#########################
# KITTIデータセットのカメラの内部パラメータ
CAMERA_INTRINSIC_PARAMS_KITTI = {
    'camera_matrix'        : np.array([[9.597910e+02, 0.000000e+00, 6.960217e+02],
                                       [0.000000e+00, 9.569251e+02, 2.241806e+02],
                                       [0.000000e+00, 0.000000e+00, 1.000000e+00]]), # カメラ行列
    'dist_coeffs'          : np.array([-3.691481e-01, 1.968681e-01, 1.353473e-03, 5.677587e-04, -6.770705e-02]), # 歪み係数
    'image_size'           : (1392, 512), # 元の画像サイズ
    'rectified_image_size' : (1242, 375)  # 歪み補正後の画像サイズ
}

# KITTIデータセットのカメラの外部パラメータ
CAMERA_EXTRINSIC_PARAMS_KITTI = {
    'rotation_matrix' : np.array([[9.999758e-01, -5.267463e-03, -4.552439e-03],
                                  [5.251945e-03,  9.999804e-01, -3.413835e-03],
                                  [4.570332e-03,  3.389843e-03,  9.999838e-01]]), # 回転行列
    'translation_vector' : np.array([5.956621e-02, 2.900141e-04, 2.577209e-03]), # 並進ベクトル
    'rectified_rotation_matrix' : np.array([[ 9.998817e-01, 1.511453e-02, -2.841595e-03],
                                            [-1.511724e-02, 9.998853e-01, -9.338510e-04],
                                            [ 2.827154e-03, 9.766976e-04,  9.999955e-01]]), # 歪み補正後の回転行列
    'projection_matrix' : np.array([[7.215377e+02, 0.000000e+00, 6.095593e+02, 4.485728e+01],
                                    [0.000000e+00, 7.215377e+02, 1.728540e+02, 2.163791e-01],
                                    [0.000000e+00, 0.000000e+00, 1.000000e+00, 2.745884e-03]]), # 歪み補正後の投影行列
}

# 物体の既知のサイズ[m]
OBJECT_SIZE = {
    "car" : 1.4476805,
    "pedestrian" : 1.7,
}

# 表示する物体のクラス
TARGET_CLASSES = ["car", "pedestrian"] # 表示するクラス

# 表示する枠と文字の色
COLOR_MAP = {
    "car"        : (  0, 0, 255), # 赤
    "pedestrian" : (255, 0,   0)  # 青
} 

# 画像の保存パス
OUTPUT_PATH = "../output/"
IMAGE_PATH  = "../data/KITTI/image/test"